Update README and stale webhook docs
